{
  "customers": [
    {"type": "financial", "name": "Alice", "issue": "I was charged twice for my subscription last month. I need a refund for the duplicate payment."},
    {"type": "technical", "name": "Bob", "issue": "The app crashes every time I try to upload a file larger than 5MB. This is blocking my work."},
    {"type": "security", "name": "Carol", "issue": "I can't log into my account. It says my password is wrong but I'm sure it's correct. I think I'm locked out."},
    {"type": "financial", "name": "David", "issue": "My invoice shows the wrong amount. I was billed $99 but my plan is only $49/month."},
    {"type": "technical", "name": "Eve", "issue": "I found a bug: when I search for items with special characters, the results are completely wrong."},
    {"type": "security", "name": "Frank", "issue": "I received an email saying someone tried to access my account from a new device. I need to secure my account."},
    {"type": "financial", "name": "Grace", "issue": "I need to cancel my subscription and get a prorated refund for the remaining days."},
    {"type": "technical", "name": "Henry", "issue": "The mobile app isn't syncing with the web version. My changes disappear when I switch devices."},
    {"type": "security", "name": "Iris", "issue": "I want to enable two-factor authentication on my account. How do I set that up?"},
    {"type": "financial", "name": "Jack", "issue": "My payment failed but I was still charged. Please reverse the charge or apply it to my account."},
    {"type": "technical", "name": "Kate", "issue": "Getting error 500 when trying to access the dashboard. It's been happening for 2 days now."},
    {"type": "security", "name": "Leo", "issue": "I forgot my password and the reset email isn't arriving. I've checked spam too."},
    {"type": "financial", "name": "Maya", "issue": "I was charged for a premium feature I never activated. Please refund this charge."},
    {"type": "technical", "name": "Nathan", "issue": "The export feature produces corrupted PDF files. I need this fixed urgently."},
    {"type": "security", "name": "Olivia", "issue": "Someone changed my email address on my account. I need to recover it immediately."},
    {"type": "financial", "name": "Peter", "issue": "My annual payment didn't apply the discount code. I should have saved 20%."},
    {"type": "technical", "name": "Quinn", "issue": "The search function returns no results even for items I know exist in my account."},
    {"type": "security", "name": "Rachel", "issue": "I want to remove all API keys from my account and generate new ones."},
    {"type": "financial", "name": "Sam", "issue": "I upgraded my plan but I'm still seeing the old features. Billing shows the new price."},
    {"type": "technical", "name": "Tina", "issue": "Notifications aren't working. I'm not getting any alerts for important updates."},
    {"type": "security", "name": "Uma", "issue": "My account shows logins from countries I've never been to. Is my account compromised?"},
    {"type": "financial", "name": "Victor", "issue": "I need a detailed invoice breakdown for tax purposes. The current invoice isn't sufficient."},
    {"type": "technical", "name": "Wendy", "issue": "Images won't load in the gallery view. Just seeing broken image icons everywhere."},
    {"type": "security", "name": "Xavier", "issue": "How do I set up SSO for my team? We need to integrate with our company's identity provider."},
    {"type": "financial", "name": "Yuki", "issue": "I accidentally purchased the wrong plan. Can I get a refund and switch to the correct one?"},
    {"type": "technical", "name": "Zara", "issue": "The dark mode toggle doesn't persist. Every time I refresh, it goes back to light mode."},
    {"type": "security", "name": "Aaron", "issue": "I need to audit all the devices that have access to my account."},
    {"type": "financial", "name": "Beth", "issue": "My company needs to update our billing address and payment method."},
    {"type": "technical", "name": "Carlos", "issue": "Video playback stutters and buffers constantly, even on fast internet."},
    {"type": "security", "name": "Diana", "issue": "I received a suspicious email asking me to verify my account. Is this legitimate?"},
    {"type": "financial", "name": "Ethan", "issue": "I was charged in the wrong currency. I should be billed in EUR, not USD."},
    {"type": "technical", "name": "Fiona", "issue": "The calendar integration with Google Calendar stopped working after the last update."},
    {"type": "security", "name": "George", "issue": "I need to revoke access for a former employee who still has team permissions."},
    {"type": "financial", "name": "Hannah", "issue": "My credit card expired and I need to update it before the next billing cycle."},
    {"type": "technical", "name": "Ivan", "issue": "The drag-and-drop feature doesn't work on Safari. Works fine on Chrome."},
    {"type": "security", "name": "Julia", "issue": "I want to set up IP whitelisting for our company's account access."},
    {"type": "financial", "name": "Kevin", "issue": "I'm being charged for users who have been deactivated. Please adjust my bill."},
    {"type": "technical", "name": "Luna", "issue": "The API rate limiting is too aggressive. My integration keeps getting blocked."},
    {"type": "security", "name": "Marcus", "issue": "How do I enable audit logs to track all changes made by team members?"},
    {"type": "financial", "name": "Nina", "issue": "I need to split the invoice across multiple cost centers for accounting."},
    {"type": "technical", "name": "Oscar", "issue": "Keyboard shortcuts stopped working after I enabled a browser extension."},
    {"type": "security", "name": "Priya", "issue": "I accidentally shared a sensitive document publicly. How do I revoke access?"},
    {"type": "financial", "name": "Ryan", "issue": "The auto-renewal charged me but I thought I had cancelled. Please refund."},
    {"type": "technical", "name": "Sofia", "issue": "The spell checker is flagging correct words as misspelled in my documents."},
    {"type": "security", "name": "Thomas", "issue": "I need to set different permission levels for different team members."},
    {"type": "financial", "name": "Ursula", "issue": "I'm a nonprofit. How do I apply for the discounted pricing?"},
    {"type": "technical", "name": "Vincent", "issue": "The undo function doesn't work properly. It skips several changes at once."},
    {"type": "security", "name": "Whitney", "issue": "I want to enable mandatory password rotation for all team members."},
    {"type": "financial", "name": "Xander", "issue": "I need a W-9 form from your company for our vendor records."},
    {"type": "technical", "name": "Yasmin", "issue": "Copy-paste from external sources brings in unwanted formatting."},
    {"type": "security", "name": "Zack", "issue": "How do I set up SAML authentication for enterprise single sign-on?"},
    {"type": "financial", "name": "Amber", "issue": "I was promised a price lock but my renewal rate increased."},
    {"type": "technical", "name": "Brandon", "issue": "The file upload progress bar gets stuck at 99% and never completes."},
    {"type": "security", "name": "Chloe", "issue": "I need to download all my data before closing my account for GDPR compliance."},
    {"type": "financial", "name": "Derek", "issue": "I paid for annual but want to switch to monthly. Can I get a partial refund?"},
    {"type": "technical", "name": "Elena", "issue": "The print layout is completely broken. Text gets cut off on every page."},
    {"type": "security", "name": "Felix", "issue": "My session keeps timing out every 5 minutes. It's very disruptive."},
    {"type": "financial", "name": "Gloria", "issue": "I need to add a PO number to my invoice for corporate expense reporting."},
    {"type": "technical", "name": "Hugo", "issue": "The autosave feature isn't working. I lost an hour of work."},
    {"type": "security", "name": "Ingrid", "issue": "I want to restrict account access to certain hours of the day."},
    {"type": "financial", "name": "James", "issue": "Why was I charged sales tax? My state doesn't require it for SaaS."},
    {"type": "technical", "name": "Kelly", "issue": "The mobile app drains my battery extremely fast when running in background."},
    {"type": "security", "name": "Liam", "issue": "I need to set up a security question as a backup recovery method."},
    {"type": "financial", "name": "Megan", "issue": "I want to pause my subscription for 3 months instead of cancelling."},
    {"type": "technical", "name": "Noah", "issue": "The table sorting is broken. Clicking column headers does nothing."},
    {"type": "security", "name": "Paige", "issue": "How do I check if my account was part of any data breach?"},
    {"type": "financial", "name": "Quentin", "issue": "I need a receipt for a payment from 6 months ago for tax filing."},
    {"type": "technical", "name": "Rebecca", "issue": "The app freezes for 10 seconds whenever I open a large project."},
    {"type": "security", "name": "Simon", "issue": "I want to disable all browser extension access to my account."},
    {"type": "financial", "name": "Tracy", "issue": "My team grew and I need to add seats mid-billing cycle. How does pricing work?"},
    {"type": "technical", "name": "Ulrich", "issue": "The real-time collaboration cursor shows wrong user names."},
    {"type": "security", "name": "Vanessa", "issue": "I need to configure allowed email domains for team invitations."},
    {"type": "financial", "name": "Walter", "issue": "I'm disputing a chargeback from my bank. Can you provide transaction proof?"},
    {"type": "technical", "name": "Ximena", "issue": "The comment threads are not loading. Just see a spinning loader forever."},
    {"type": "security", "name": "Yolanda", "issue": "How do I report a potential security vulnerability I found in your app?"},
    {"type": "financial", "name": "Zane", "issue": "I need to transfer my subscription to a different email/account."},
    {"type": "technical", "name": "Aria", "issue": "The webhook notifications are delayed by several hours."},
    {"type": "security", "name": "Blake", "issue": "I want to set up email alerts for any login from a new device."},
    {"type": "financial", "name": "Cassidy", "issue": "The enterprise quote I received has expired. Can you extend it?"},
    {"type": "technical", "name": "Dominic", "issue": "The date picker shows wrong timezone. Events appear on wrong days."},
    {"type": "security", "name": "Elise", "issue": "I need to enforce password complexity requirements for my organization."},
    {"type": "financial", "name": "Finn", "issue": "I'm getting charged but my account shows as suspended. What's happening?"},
    {"type": "technical", "name": "Greta", "issue": "The attachment download fails with a network error every time."},
    {"type": "security", "name": "Harrison", "issue": "How do I enable login notifications via SMS instead of email?"},
    {"type": "financial", "name": "Isla", "issue": "I need to consolidate billing for multiple accounts under one invoice."},
    {"type": "technical", "name": "Jasper", "issue": "The color picker tool doesn't show the hex values correctly."},
    {"type": "security", "name": "Kira", "issue": "I accidentally clicked a phishing link. Is my account at risk?"},
    {"type": "financial", "name": "Lorenzo", "issue": "My bank blocked the recurring payment. How do I retry without losing access?"},
    {"type": "technical", "name": "Melody", "issue": "The voice recording feature has terrible audio quality."},
    {"type": "security", "name": "Nadia", "issue": "I want to review all third-party app connections to my account."},
    {"type": "financial", "name": "Owen", "issue": "I'm a reseller and need special pricing for bulk license purchases."},
    {"type": "technical", "name": "Piper", "issue": "The charts and graphs render incorrectly on high-DPI displays."},
    {"type": "security", "name": "Quincy", "issue": "How do I set up encrypted storage for sensitive documents?"},
    {"type": "financial", "name": "Riley", "issue": "I need an extended payment term for our organization. Net-60 instead of immediate."},
    {"type": "technical", "name": "Stella", "issue": "The translation feature produces garbled text for Asian languages."},
    {"type": "security", "name": "Trevor", "issue": "I need to comply with HIPAA. What security certifications do you have?"},
    {"type": "financial", "name": "Unity", "issue": "I was grandfathered into old pricing but got moved to new rates."},
    {"type": "technical", "name": "Vera", "issue": "The version history only shows the last 3 versions, not all of them."},
    {"type": "security", "name": "Warren", "issue": "I need to set up separate admin and user roles for compliance."}
  ]
}
